src/main/java/kijkenofditwerkt.xml

<wsdl:definitions
        xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
        xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
        xmlns:http="http://schemas.xmlsoap.org/wsdl/http/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:req="http://dylangomezvazquez/AccuLadenRequest"
        xmlns:rsp="http://dylangomezvazquez/AccuLadenResponse"
        xmlns:flt="http://dylangomezvazquez/AccuLadenError"
        xmlns="http://dylangomezvazquez/AccuLaden"
        targetNamespace="http://dylangomezvazquez/AccuLaden">
    <wsdl:types>
        <xsd:schema>
            <xsd:import namespace="http://dylangomezvazquez/AccuLadenRequest"
                        schemaLocation="AccuLadenRequest.xsd" />
            <xsd:import namespace="http://dylangomezvazquez/AccuLadenResponse"
                        schemaLocation="AccuLadenResponse.xsd" />
            <xsd:import namespace="http://dylangomezvazquez/AccuLadenError"
                        schemaLocation="AccuLadenError.xsd" />
        </xsd:schema>
    </wsdl:types>
    <wsdl:message name="request">
        <wsdl:part name="request" element="req:AccuLadenRequest"/>
    </wsdl:message>
    <wsdl:message name="response">
        <wsdl:part name="response" element="rsp:AccuLadenResponse"/>
    </wsdl:message>
    <wsdl:message name="ApplicatieFout">
        <wsdl:part name="ApplicatieFout" element="flt:ApplicatieFout"/>
    </wsdl:message>


    <wsdl:portType name="WS-Interface">
        <wsdl:operation name="AccuLaden">
            <wsdl:input message="request"/>
            <wsdl:output message="response"/>
            <wsdl:fault name="ApplicatieFout" message="ApplicatieFout"/>
        </wsdl:operation>
    </wsdl:portType>

    <wsdl:binding name="WS-Binding" type="WS-Interface">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="AccuLaden">
            <soap:operation soapAction="" style="document"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
            <wsdl:fault name="ApplicatieFout">
                <soap:fault name="ApplicatieFout" use="literal"/>
            </wsdl:fault>
        </wsdl:operation>
    </wsdl:binding>

    <wsdl:service name="mijnService">
        <wsdl:port name="WS-Port" binding="WS-Binding">
            <soap:address location="http://localhost:8080/webservice/AccuLaden"/>
        </wsdl:port>
    </wsdl:service>

</wsdl:definitions>